layui.use('form', function(){
    var form = layui.form,$ = layui.$;
    form.verify({
        username: [/^[a-zA-Z0-9]{4,16}$/,'用户名为4到16位字母或数字组合']
        ,password: [/^.*(?=.{6,12})(?=.*\d)(?=.*[A-Z])(?=.*[a-z]).*$/,'密码必须6到12位，至少包含一个大写字母，一个小写字母和一个数字']
        ,realName: [/^[\u4e00-\u9fa5]{2,4}$/,'真实姓名为2到4位中文汉字组成']
        ,verifyCode:[/^[0-9]{6,6}$/,'验证码为6位数字']
        ,qq:[/^[0-9]{5,12}$/,'QQ号由5至12位数字组成']
        ,home: [/^[\u4e00-\u9fa5]{6,20}$/,'籍贯为6到20位中文汉字组成']
        ,school: [/^[\u4e00-\u9fa5]{4,15}$/,'学校为4到15位中文汉字组成']
        ,academy: [/^[\u4e00-\u9fa5]{4,15}$/,'学院为4到15位中文汉字组成']
        ,major: [/^[\u4e00-\u9fa5]{2,10}$/,'专业为2到10位中文汉字组成']
        ,schoolClass: [/^(?![0-9]+$)(?![\u4e00-\u9fa5]+$)[0-9\u4e00-\u9fa5]{6,10}$/,'大学班级为6到10位中文和数字组成']
    });
});